app/views/cocktails/show.html.erb

<ul>
<% @cocktail.mixers.each do |mixer| %>
---
SELECT "mixers".* FROM "mixers" INNER JOIN "cocktail_mixers" ON "mixers"."id" = "cocktail_mixers"."mixer_id" WHERE "cocktail_mixers"."cocktail_id" = ?  [["cocktail_id", 1]]

<ul>
<% @cocktail.garnishes.each do |garnish| %>
---
SELECT "garnishes".* FROM "garnishes" INNER JOIN "cocktail_garnishes" ON "garnishes"."id" = "cocktail_garnishes"."garnish_id" WHERE "cocktail_garnishes"."cocktail_id" = ?  [["cocktail_id", 1]]

<ul>
<% @cocktail.alcohols.each do |alcohol| %>
---
SELECT "alcohols".* FROM "alcohols" INNER JOIN "cocktail_alcohols" ON "alcohols"."id" = "cocktail_alcohols"."alcohol_id" WHERE "cocktail_alcohols"."cocktail_id" = ?  [["cocktail_id", 1]]

<li>
<% cocktail = Cocktail.all.sample %>
---
SELECT "cocktails".* FROM "cocktails"