app/views/garnishes/show.html.erb

SELECT "cocktails".* FROM "cocktails" INNER JOIN "cocktail_garnishes" ON "cocktails"."id" = "cocktail_garnishes"."cocktail_id" WHERE "cocktail_garnishes"."garnish_id" = ?  [["garnish_id", 1]]
---
<ul>
<% @garnish.cocktails.each do |cock| %>