app/views/mixers/show.html.erb

SELECT "cocktails".* FROM "cocktails" INNER JOIN "cocktail_mixers" ON "cocktails"."id" = "cocktail_mixers"."cocktail_id" WHERE "cocktail_mixers"."mixer_id" = ?  [["mixer_id", 1]]
---
<ul>
<% @mixer.cocktails.each do |cock| %>