app/controllers/alcohols_controller.rb

    def index
        @alcohols = Alcohol.all
---
SELECT "alcohols".* FROM "alcohols"

    def show
        @alcohol = Alcohol.find(params[:id])
---
SELECT "alcohols".* FROM "alcohols" WHERE "alcohols"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]