app/controllers/cocktails_controller.rb

    def show
        @cocktail = Cocktail.find(params[:id])
        @cocktails = Cocktail.all
---
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cocktails".* FROM "cocktails"