app/controllers/garnishes_controller.rb

    def index
        @garnishes = Garnish.all
---
SELECT "garnishes".* FROM "garnishes"

    def show
        @garnish = Garnish.find(params[:id])
---
SELECT "garnishes".* FROM "garnishes" WHERE "garnishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]