app/controllers/mixers_controller.rb

SELECT "mixers".* FROM "mixers"
---
    def index
        @mixers = Mixer.all

SELECT "mixers".* FROM "mixers" WHERE "mixers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @mixer = Mixer.find(params[:id])