app/views/alcohols/show.html.erb

SELECT "cocktails".* FROM "cocktails" INNER JOIN "cocktail_alcohols" ON "cocktails"."id" = "cocktail_alcohols"."cocktail_id" WHERE "cocktail_alcohols"."alcohol_id" = ?  [["alcohol_id", 1]]
---
<p class="title2">Cocktails that contain this alcohol: </p>
    <% @alcohol.cocktails.each do |cock| %>